Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The JWT string is the Base64 URL encoded string that has 3 parts separated by '.' characters. First part - JWT headers, second part - JWT claims, third part - JWT signature.
ja_jp: JWT 文字列は Base64 URL でエンコードされた文字列で、'.' で区切られた 3 つのパートで構成されています。最初のパートは JWT ヘッダー、2 つ目のパートは JWT クレーム、3 つ目のパートは JWT シグネチャーです。

source: The Jackson extension will then use the produced build item to register a module within Jackson automatically.
ja_jp: そして、Jackson エクステンションは、生成されたビルドアイテムを使用して、Jackson 内で自動的にモジュールを登録します。

source: The Jakarta Persistence `IdentityProvider` creates a `SecurityIdentity` instance, which is used during user authentication to verify and authorize access requests making your Quarkus application secure.
ja_jp: Jakarta Persistence `IdentityProvider` は、 `SecurityIdentity` インスタンスを作成します。このインスタンスは、ユーザー認証時に使用され、アクセス要求の検証と認可を行い、Quarkusアプリケーションを保護します。

source: The Jakarta Persistence `IdentityProvider` creates a `SecurityIdentity` instance. During user authentication, this instance is used to verify and authorize access requests.
ja_jp: Jakarta Persistence `IdentityProvider` は、 `SecurityIdentity` インスタンスを作成します。ユーザ認証の際、このインスタンスはアクセス要求の検証と認可に使用されます。

source: The Jakarta Persistence `IdentityProvider` verifies and converts a xref:security-basic-authentication.adoc[Basic authentication] user name and password pair to a `SecurityIdentity` instance, which is used to authorize access requests, making your Quarkus application secure.
ja_jp: Jakarta Persistence の `IdentityProvider` は、xref:security-basic-authentication.adoc[Basic 認証] のユーザー名とパスワードのペアを検証して `SecurityIdentity` インスタンスに変換します。このインスタンスはアクセス要求を承認するために使用され、Quarkus アプリケーションを安全にします。

source: The Jakarta REST `SecurityContext` is injected to inspect the security state of the request. The `getResponseString()` function generates the response.
ja_jp: Jakarta REST `SecurityContext` は、リクエストのセキュリティー状態を検査するために挿入されます。 `getResponseString()` 関数はレスポンスを生成します。

source: The Jakarta REST endpoint
ja_jp: Jakarta RESTエンドポイント

source: The Jakarta REST resource can also be substituted with a Spring Web controller as Quarkus supports REST endpoint definition using Spring controllers. See the xref:spring-web.adoc[Spring Web guide] for more details.
ja_jp: QuarkusはSpring Web コントローラを使用したRESTエンドポイント定義をサポートしているため、Jakarta RESTリソースはSpring Webコントローラで代用することも可能です。詳細については、 link:spring-web.html[Spring Webガイド] を参照してください。

source: The Jakarta REST resources
ja_jp: Jakarta RESTリソース

source: The Jakarta REST way
ja_jp: ジャカルタRESTの方式

source: The Jandex index
ja_jp: Jandexインデックス

source: The Jandex index doesn't contain all the classes around but is, by default, limited to the application classes and the dependencies containing either a pre-built index or an empty `META-INF/beans.xml`.
ja_jp: Jandexのインデックスは、すべてのクラスを含んでいるわけではなく、デフォルトでは、アプリケーションクラスと、事前に構築されたインデックスまたは空の `META-INF/beans.xml` を含む依存関係に限定されています。

source: The January Newsletter has been published! This month, you can find articles about the Java InfoQ Trend report for December 2021, how to use Quarkus with the service binding operator, how to run Qurkus applications on Kubernetes, and lessons learned migrating Spring Boot to Quarkus.
ja_jp: 1月のニュースレターが発行されました!今月は、2021年12月のJava InfoQ Trendレポート、サービスバインディングオペレーターを使ったQuarkusの使い方、Kubernetes上でQurkusアプリケーションを実行する方法、Spring BootをQuarkusに移行する際の教訓などの記事が掲載されています。

source: The Java ecosystem has long been foundational for interoperability.
ja_jp: Javaエコシステムは、長年にわたり相互運用性の基盤となってきました。

source: The Java interface representing the GraphQL union does not have to be empty, but any getters defined will not explicitly change the GraphQL schema.
ja_jp: GraphQLユニオンを表すJavaインターフェイスは空である必要はありませんが、定義されたゲッターは明示的にGraphQLスキーマを変更するものではありません。

source: The JobScheduler does not support persistent schedules.
ja_jp: JobScheduler は永続的なスケジュールをサポートしていません。

source: The Journey to Top-Level Project
ja_jp: トップレベルプロジェクトへの道のり

source: The KNative descriptors use https://knative.dev/docs/serving[KNative Serving^] for each of the five applications.
ja_jp: KNativeディスクリプタは、5つのアプリケーションのそれぞれに link:https://knative.dev/docs/serving[KNative Serving, window=_blank]を使用しています。

source: The Kafka Dev Service will be enabled when the `quarkus-kafka-client` extension is present in your application, and the broker address has not been explicitly configured. More information can be found at the xref:kafka-dev-services.adoc[Kafka Dev Services Guide].
ja_jp: Kafka Dev Serviceは、アプリケーションに `quarkus-kafka-client` エクステンションが存在し、ブローカー・アドレスが明示的に設定されていない場合に有効になります。詳細については、 link:kafka-dev-services.html[Kafka Dev Services Guide]を参照してください。

source: The Kafka Dev Service will be enabled when the `quarkus-kafka-client` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:kafka-dev-services.adoc[Kafka Dev Services Guide].
ja_jp: Kafka Dev Serviceは、アプリケーションに `quarkus-kafka-client` エクステンションが存在し、ブローカー・アドレスが明示的に設定されていない場合に有効になります。詳細については、 link:kafka-dev-services.html[Kafka Dev Services ガイド]を参照してください。

source: The Kafka Dev Services supports xref:compose-dev-services.adoc[Compose Dev Services]. It relies on a `compose-devservices.yml`, such as:
ja_jp: Kafka Dev Services は xref:compose-dev-services.adoc[Compose Dev Services] をサポートしています。これは、以下のような `compose-devservices.yml` に依存します。

source: The Kafka Request-Reply pattern allows to publish a request record to a Kafka topic and then await for a reply record that responds to the initial request. The Kafka connector provides the `KafkaRequestReply` custom emitter that implements the requestor (or the client) of the request-reply pattern for Kafka outbound channels:
ja_jp: Kafka request-reply パターンを使用すると、リクエストレコードを Kafka トピックに公開し、最初のリクエストに応答する返信レコードを待機できます。 Kafka コネクターは、Kafka 送信チャネルの request-reply パターンのリクエスター (またはクライアント) を実装する `KafkaRequestReply` カスタムエミッターを提供します。

source: The Kafka Streams extension is configured via the Quarkus configuration file `application.properties`. Create the file `aggregator/src/main/resources/application.properties` with the following contents:
ja_jp: Kafka Streams エクステンションは、Quarkusの設定ファイル `application.properties` で設定します。ファイル `aggregator/src/main/resources/application.properties` を以下の内容で作成します。

source: The Kafka and AMQP connector creates a duplicated context for each message, implementing a _message context_. This message context is used for the complete message processing and thus can be used to propagate data.
ja_jp: Kafka と AMQP コネクタは、 _メッセージコンテキスト_ を実装し、各メッセージに対して複製コンテキストを作成します。 このメッセージコンテキストは完全なメッセージ処理に使用されるため、データの伝播に使用できます。

source: The Kafka connector disables the Kafka auto commit when it is not explicitly enabled. This behavior differs from the traditional Kafka consumer. If high throughput is important for you, and you are not limited by the downstream, we recommend to either:
ja_jp: Kafka コネクターは、明示的に有効にされていない場合、Kafka 自動コミットを無効にします。この動作は、従来の Kafka コンシューマーとは異なります。高スループットが重要であり、ダウンストリームに制限されていない場合は、次のいずれかをお勧めします。

source: The Kafka connector for Reactive Messaging
ja_jp: リアクティブメッセージング用の Kafka コネクター

source: The Kafka connector supports three strategies:
ja_jp: Kafka コネクターは、以下の 3 つのストラテジーをサポートします。

source: The Kafka connector used by Quarkus has built-in support for Cloud Events. It can send and consume Cloud Events using the structured mode (encoding everything in a JSON payload) or the binary mode (using Kafka headers).
ja_jp: Quarkusが使用するKafkaコネクタは、Cloud Eventsをビルトインでサポートしています。構造化モード(JSONペイロードですべてをエンコード)またはバイナリーモード(Kafkaヘッダーを使用)を使用して、クラウドイベントを送信したり消費したりすることができます。

source: The Kafka outbound connector handles back-pressure, monitoring the number of in-flight messages waiting to be written to the Kafka broker. The number of in-flight messages is configured using the `max-inflight-messages` attribute and defaults to 1024.
ja_jp: Kafka アウトバウンドコネクターはバックプレッシャーを処理し、Kafka ブローカーへの書き込みを待機しているインフライトメッセージの数を監視します。インフライトメッセージの数は、 `max-inflight-messages` 属性を使用して設定され、デフォルトは 1024 になります。

source: The Kafka transaction terminates on the Kafka producer sender thread. We need to switch to the Vert.x context previously captured in order to terminate the Hibernate Reactive transaction on the same context we started it.
ja_jp: Kafka トランザクションは、Kafka プロデューサー送信者スレッドで終了します。開始したのと同じコンテキストで Hibernate Reactive トランザクションを終了するために、以前にキャプチャーした Vert.x コンテキストに切り替える必要があります。

source: The Keycloak Authorization extension, `quarkus-keycloak-authorization`, extends the OpenID Connect extension, `quarkus-oidc`, to provide advanced authorization capabilities. It features a policy enforcer that dynamically manages access to secured resources. Access is governed by permissions defined in Keycloak, supporting flexible and dynamic Resource-Based Access Control (RBAC).
ja_jp: Keycloak Authorization エクステンション の `quarkus-keycloak-authorization` は、OpenID Connect エクステンションの `quarkus-oidc` を拡張して、高度な認可機能を提供します。 これには、保護されたリソースへのアクセスを動的に管理するポリシーエンフォーサーが備わっています。 アクセスは Keycloak で定義された権限によって管理され、柔軟で動的なリソースベースのアクセス制御 (RBAC) をサポートします。

source: The Keycloak Dev Service will be enabled when the `quarkus-oidc` extension is present in your application, and the server address has not been explicitly configured. More information can be found at the xref:security-openid-connect-dev-services.adoc[OIDC Dev Services Guide].
ja_jp: Keycloak Dev Serviceは、アプリケーションに `quarkus-oidc` エクステンションが存在し、サーバ・アドレスが明示的に設定されていない場合に有効になります。詳細は， link:security-openid-connect-dev-services.html[OIDC Dev Services Guide]を参照してください。

source: The Keycloak Dev Service will be enabled when the `quarkus-oidc` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:security-openid-connect-dev-services.adoc[OIDC Dev Services Guide].
ja_jp: Keycloak Dev Serviceは、アプリケーションに `quarkus-oidc` エクステンションが存在し、サーバ・アドレスが明示的に設定されていない場合に有効になります。詳細は， link:security-openid-connect-dev-services.html[OIDC Dev Services ガイド]を参照してください。

source: The Keycloak Policy Enforcer secures the `/api/protected/standard-way` request path, removing the need for annotations such as `@RolesAllowed`. However, in some scenarios, you may need to perform a programmatic check.
ja_jp: Keycloak Policy Enforcer は `/api/protected/standard-way` リクエストパスを保護し、 `@RolesAllowed` などのアノテーションの必要性を排除します。 ただし、シナリオによっては、プログラムによるチェックを実行する必要がある場合があります。

source: The Kogito Dev Service will be enabled when either `kogito-quarkus` or `kogito-quarkus-processes` extension is present in your application. More information can be found at the xref:kogito-dev-services.adoc[Kogito Dev Services Guide].
ja_jp: アプリケーションに `kogito-quarkus` または `kogito-quarkus-processes` のいずれかのエクステンションがある場合、Kogito Dev Service が有効になります。詳細は、 link:kogito-dev-services.html[Kogito Dev Services Guide]を参照してください。

source: The Kogito Dev Service will be enabled when either `kogito-quarkus` or `kogito-quarkus-processes` extension is present in your application. More information can be found in the xref:kogito-dev-services.adoc[Kogito Dev Services Guide].
ja_jp: アプリケーションに `kogito-quarkus` または `kogito-quarkus-processes` のいずれかのエクステンションがある場合、Kogito Dev Service が有効になります。詳細は、 link:kogito-dev-services.html[Kogito Dev Services ガイド]を参照してください。

source: The Kotlin plugin is activated, which implicitly adds `sourceDirectory` and `testSourceDirectory` build properties to point to Kotlin sources (`src/main/kotlin` and `src/test/kotlin` respectively)
ja_jp: Kotlin プラグインが有効になり、暗黙のうちに `sourceDirectory` と `testSourceDirectory` のビルドプロパティーが追加され、Kotlin ソース (それぞれ `src/main/kotlin` と `src/test/kotlin` ) を指すようになります。

source: The Kotlin plugin version needs to be specified.
ja_jp: Kotlinプラグインのバージョンを指定する必要があります。

source: The Kubernetes API url
ja_jp: Kubernetes APIのURL

source: The Kubernetes Client extension has transitive dependencies to all of the vanilla Kubernetes API model types. This is very convenient in JVM mode, since you don't need to worry about configuring the project.
ja_jp: Kubernetes クライアントエクステンションは、すべての標準 Kubernetes API モデルタイプへの推移的依存関係を持っています。これは、プロジェクトの設定を気にする必要がないため、JVM モードでは非常に便利です。

source: The Kubernetes Client has been upgraded to version 6.5.
ja_jp: Kubernetes クライアントがバージョン6.5にアップグレードされました。

source: The Kubernetes Dev Service will be enabled when `kubernetes-client` extension is present in your application, and the API server address has not been explicitly configured. More information can be found in the xref:kubernetes-dev-services.adoc[Kubernetes Dev Services Guide].
ja_jp: Redis Dev Serviceは、アプリケーションに `quarkus-redis-client` エクステンションが存在し、サーバー・アドレスが明示的に設定されていない場合に有効になります。詳細は、 link:redis-dev-services.html[Redis Dev Services Guide]を参照してください。

source: The Kubernetes Dev Service will be enabled when the `kubernetes-client` extension is present in your application, and the API server address has not been explicitly configured. More information can be found in the xref:kubernetes-dev-services.adoc[Kubernetes Dev Services Guide].
ja_jp: Kubernetes Dev Serviceは、 `kubernetes-client` エクステンションがアプリケーションに存在し、APIサーバーアドレスが明示的に設定されていない場合に有効になります。 詳細は xref:kubernetes-dev-services.adoc[Kubernetes Dev Services ガイド] をご覧ください。

source: The Kubernetes Service resource, `color-service`, that Stork will discover.
ja_jp: Stork が検出する Kubernetes Service リソースである `color-service`。

source: The Kubernetes and OpenShift client extensions aim to provide a great *developer experience* while enabling the client to work in *native mode*. When building a native image, the Kubernetes Client extension will register all the accessible Kubernetes model classes for reflection. Unfortunately, this can lead to large native image sizes and longer build times.
ja_jp: Kubernetes および OpenShift クライアントエクステンションは、クライアントが *ネイティブモード* で動作できるようにしつつ、優れた *開発者エクスペリエンス* を提供することを目指しています。ネイティブイメージをビルドする場合、Kubernetes クライアントエクステンションは、アクセス可能なすべての Kubernetes モデルクラスをリフレクション用に登録します。残念ながら、これはネイティブイメージのサイズを大きくし、ビルド時間を長くする可能性があります。

source: The Kubernetes extension allows the user to configure both volumes and mounts for the application. Any volume can be mounted with a simple configuration:
ja_jp: Kubernetes エクステンションを使用すると、アプリケーションのボリュームとマウントの両方を設定することができます。 簡単な設定で任意のボリュームをマウントすることができます。

source: The Kubernetes extension allows tuning the generated manifest, using the `application.properties` file. Here are some examples:
ja_jp: Kubernetes のエクステンションでは、`application.properties` ファイルを使用して生成されたマニフェストをチューニングすることができます。 ここではいくつかの例を紹介します。

source: The Kubernetes extension will detect the presence of the Picocli extension and hence generate a https://kubernetes.io/docs/concepts/workloads/controllers/job/[Job] resource instead of a https://kubernetes.io/docs/concepts/workloads/controllers/deployment/[Deployment] resource in the `target/kubernetes/` directory.
ja_jp: Kubernetes エクステンションは Picocli エクステンションの存在を検出し、 `target/kubernetes/` ディレクトリに link:https://kubernetes.io/docs/concepts/workloads/controllers/deployment/[Deployment] リソースの代わりに link:https://kubernetes.io/docs/concepts/workloads/controllers/job/[Job] リソースを生成します。

source: The LLM generates a "Grounded Answer" based on the provided context.
ja_jp: LLMは、提供されたコンテキストに基づいて「Grounded Answer」を生成します。

source: The LRA (short for Long Running Action) participant extension is useful in microservice based designs where different services can benefit from a relaxed notion of distributed consistency.
ja_jp: LRA（Long Running Actionの略）参加者エクステンションは、マイクロサービスベースの設計で、異なるサービスが分散一貫性の緩和された概念を利用できる場合に便利です。

source: The LRA Dev Services supports xref:compose-dev-services.adoc[Compose Dev Services]. It relies on a `compose-devservices.yml`, such as:
ja_jp: LRA Dev Services は xref:compose-dev-services.adoc[Compose Dev Services] をサポートしています。これは `compose-devservices.yml` に依存します。例:

source: The LRA extension can be configured by updating an `application.properties` file in the `src/main/resources` directory. The only LRA specific property is `quarkus.lra.coordinator-url=<url>` which specifies the HTTP endpoint of an external coordinator, for example:
ja_jp: LRAエクステンションは、 `src/main/resources` ディレクトリ内の `application.properties` ファイルを更新することで設定できます。LRA固有のプロパティは、 `quarkus.lra.coordinator-url=<url>` 、外部コーディネーターのHTTPエンドポイントを指定するだけです。

source: The LRA will still be running, as you may verify by querying the coordinator (`curl http://localhost:50000/lra-coordinator`).
ja_jp: コーディネーターに問い合わせれば、LRAはまだ動いていることが確認できます (`curl http://localhost:50000/lra-coordinator`)。

source: The Let's Encrypt ACME challenge requires that the application is reachable on port `80` (basically: `http://your-dns-name`). Ensure the port `80` is accessible from the Internet. It might require an explicit security policy depending on your hosting provider.
ja_jp: Let's Encrypt ACME チャレンジでは、アプリケーションがポート `80` (基本的には `http://your-dns-name`) でアクセスできる必要があります。 ポート `80` がインターネットからアクセス可能であることを確認します。 ホスティングプロバイダーによっては、明示的なセキュリティーポリシーが必要になる場合があります。

source: The Let's Encrypt ACME challenge requires that the application is reachable on port `80`, essentially `http://your-dns-name`. Ensure the port `80` is accessible from the Internet. It might require an explicit security policy depending on your hosting provider.
ja_jp: Let's Encrypt ACME チャレンジでは、アプリケーションがポート `80` (基本的には `http://your-dns-name`) でアクセスできる必要があります。 ポート `80` がインターネットからアクセス可能であることを確認します。 ホスティングプロバイダーによっては、明示的なセキュリティーポリシーが必要になる場合があります。

source: The Liquibase MongoDB extension support relies on the Quarkus MongoDB client config. For the time being, it does not support multiple clients. You need to add the MongoDB config to the `{config-file}` file in order to allow Liquibase to manage the schema.
ja_jp: Liquibase MongoDB エクステンションのサポートは、Quarkus MongoDB クライアント設定に依存しています。 今のところ、複数のクライアントをサポートしていません。 Liquibase がスキーマを管理できるようにするために、 `{config-file}` ファイルに MongoDB 設定を追加する必要があります。

source: The Liquibase MongoDB extension support relies on the Quarkus MongoDB client config. You need to add the MongoDB config to the `{config-file}` file in order to allow Liquibase to manage the schema.
ja_jp: Liquibase MongoDB エクステンションのサポートは、Quarkus MongoDB クライアント設定に依存しています。Liquibase がスキーマを管理できるようにするには、MongoDB 設定を `{config-file}` ファイルに追加する必要があります。

source: The Log4j 2 adapter is provided by the following dependency:
ja_jp: Log4j 2 アダプターは、以下の依存関係によって提供されます。

source: The LoggingCloudWatchHandlerValueFactory is the glue between the actually business logic of the extension: dealing with application logs and putting these logs to AWS and the configurations of the _application.properties_ file mentioned before. As you can see in the _create()_ method, configuration entries are checked and used for initializing the CloudWatch connection.
ja_jp: LoggingCloudWatchHandlerValueFactoryは、アプリケーションのログを扱い、これらのログをAWSに置くという、エクステンションの実際のビジネスロジックと、前述の _application.properties_ファイルの設定との間の接着剤となります。 _create()_メソッドの中で、設定項目がチェックされ、CloudWatch接続の初期化に使用されていることがわかります。

source: The MP Metrics API compatibility layer may be moved to a different extension in the future.
ja_jp: MP Metrics API 互換性レイヤーは、将来的に別のエクステンションに移動される可能性があります。

source: The MP Metrics API compatibility layer will be moved to a different extension in the future.
ja_jp: MP Metrics API互換性レイヤは、将来的には別のエクステンションに移される予定です。

source: The MVC approach is also made very easy with Quarkus thanks to Qute.
ja_jp: MVC アプローチも、Qute のおかげで Quarkus で非常に簡単になりました。

source: The MVC approach is also made very easy with Quarkus thanks to https://docs.quarkiverse.io/quarkus-renarde/dev/index.html[the Renarde extension], a Rails-like framework using Qute.
ja_jp: Quarkus では、Qute を使用した Rails のようなフレームワークである https://docs.quarkiverse.io/quarkus-renarde/dev/index.html[Renarde エクステンション] があるため、MVC アプローチも非常に簡単になります。

source: The March newsletter has been sent. Learn about what's new with Java 17 and containers, read about LogicDrop and Vaadin's path to using Quarkus, and get a look at Continuous testing with Quarkus. Additionally, you'll get more insights into how Keycloak is ow fully cloud-native with Quarkus and learn how to create your first API with Kotlin and Quarkus. Also see the lastest Quarkus Insights episodes and upcoming Quarkus attended events.
ja_jp: 3月号ニュースレターを配信しました。Java 17とコンテナの新機能、LogicDropとVaadinのQuarkus使用への道のり、Quarkusを使用した継続的テストについてご覧いただけます。さらに、KeycloakがQuarkusを使用して完全にクラウドネイティブになる方法と、KotlinとQuarkusを使用して最初のAPIを作成する方法について、より深く理解することができます。また、最新のQuarkus Insightsのエピソードや、Quarkusが参加する予定のイベントもご覧ください。

source: The Maven and Gradle plugins will validate this for you and alert you to any deployment artifacts you might have forgotten to add.
ja_jp: Maven および Gradle プラグインはこれを検証し、追加し忘れた可能性のあるデプロイメントアーティファクトがあれば警告します。

source: The Maven home dir is used to resolve the global settings file unless it was explicitly provided on the command line with the `-gs` argument
ja_jp: Maven のホームディレクトリは、コマンドラインで `-gs` 引数を使って明示的に提供されていない限り、グローバル設定ファイルの解決に使用されます。

source: The Maven project also imports the Quarkus Quartz extension.
ja_jp: MavenプロジェクトはQuarkus Quartzエクステンションもインポートします。

source: The May newsletter is out!
ja_jp: 5月号ニュースレターを発行しました!

source: The MicroProfile Config configuration file in `src/main/resources/META-INF/microprofile-config.properties`.
ja_jp: `src/main/resources/META-INF/microprofile-config.properties` にある MicroProfile Config 設定ファイル。

source: The MicroProfile Config specification defines configuration keys as an arbitrary `.`-delimited string. However, structured formats like YAML only support a subset of the possible configuration namespace. For example, consider the two configuration properties `quarkus.http.cors` and `quarkus.http.cors.methods`. One property is the prefix of another, so it may not be immediately evident how to specify both keys in your YAML configuration.
ja_jp: MicroProfile Configの仕様では、設定キーを任意の `.` 区切りの文字列として定義しています。しかし、YAMLのような構造化されたフォーマットでは、可能な構成の名前空間のサブセットしかサポートしていません。例えば、2つの設定プロパティ `quarkus.http.cors` と `quarkus.http.cors.methods` を考えてみましょう。1つのプロパティは別のプロパティのプレフィックスであるため、YAML設定で両方のキーを指定する方法はすぐにはわからないかもしれません。

source: The MicroProfile Config specification defines configuration properties as an arbitrary `.`-delimited string. However, structured formats such as YAML only support a subset of the possible configuration namespace. For example, consider the two configuration properties `one.two` and `one.two.three`. One property is the prefix of another, so it might not be immediately evident how to specify both keys in your YAML configuration.
ja_jp: MicroProfile Config 仕様は、設定プロパティー を任意の `.` 区切りの文字列として定義します。しかし、YAML のような構造化された形式では、利用可能な設定名前空間のサブセットしかサポートしません。たとえば、2 つの 設定プロパティー `one.two` と `one.two.three` を考えてみましょう。一方のプロパティーはもう一方のプレフィックスであるため、YAML 設定で両方のキーを指定する方法はすぐに明らかではないかもしれません。

source: The MicroProfile Config specification defines configuration properties as an arbitrary `.`-delimited string. However, structured formats such as YAML only support a subset of the possible configuration namespace. For example, consider the two configuration properties `quarkus.http.cors` and `quarkus.http.cors.methods`. One property is the prefix of another, so it might not be immediately evident how to specify both keys in your YAML configuration.
ja_jp: MicroProfile Config 仕様では、設定プロパティを `.` で区切られた任意の文字列として定義します。 しかし、YAML のような構造化フォーマットはありうる設定名前空間のサブセットしかサポートしません。 例えば、2 つの設定プロパティ `quarkus.http.cors` と `quarkus.http.cors.methods` を考えてみましょう。 一方のプロパティはもう一方のプロパティのプレフィックスなので、YAML 設定で両方のキーを指定する方法はすぐにはわからないかもしれません。

source: The MicroProfile OpenAPI way
ja_jp: MicroProfile OpenAPI 方式

source: The MicroProfile REST Client specification introduces the `org.eclipse.microprofile.rest.client.ext.ResponseExceptionMapper` whose purpose is to convert an HTTP response to an exception.
ja_jp: MicroProfile REST Client 仕様では、HTTP 応答を例外に変換することを目的とした `org.eclipse.microprofile.rest.client.ext.ResponseExceptionMapper` が導入されています。

source: The MicroProfile REST client allows amending request headers by registering a `ClientHeadersFactory` with the `@RegisterClientHeaders` annotation.
ja_jp: MicroProfile REST クライアントでは、 `ClientHeadersFactory` を `@RegisterClientHeaders` アノテーションで登録することで、リクエストヘッダを修正することができます。
